       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASN-GRAPH-GEN.

       DATA DIVISION.
       PROCEDURE DIVISION.
       
       DISPLAY "TEST"
       STOP RUN.

       END PROGRAM ASN-GRAPH-GEN.
